In [2]:
## This is a simple start point for pandas
# first step: import 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
# Create objects in pandas

# create a series
s1 = pd.Series([1,3,5,np.nan,6,8])
s1

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [7]:
# create a DataFrame passing a numpy array with datetime index  and labeled collumns
dates = pd.date_range('20160101',periods=5)
dates
df = pd.DataFrame(np.random.randn(5,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2016-01-01  0.357269 -0.049457 -1.283958  1.226443
2016-01-02 -1.745362  2.344277  0.800201  0.002229
2016-01-03  0.557898  0.573969 -0.299545 -0.881255
2016-01-04 -0.351362  0.814559  0.559755 -0.906109
2016-01-05  0.298535 -0.532091  0.766118  0.033809

In [10]:
# create a DataFrame by passing a dict of objects
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20161221'),
    'C': pd.Series(1,index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'
})
df2

   A          B  C  D      E    F
0  1 2016-12-21  1  3   test  foo
1  1 2016-12-21  1  3  train  foo
2  1 2016-12-21  1  3   test  foo
3  1 2016-12-21  1  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df2.head(2)

   A          B  C  D      E    F
0  1 2016-12-21  1  3   test  foo
1  1 2016-12-21  1  3  train  foo

In [16]:
df2.tail(3)

   A          B  C  D      E    F
1  1 2016-12-21  1  3  train  foo
2  1 2016-12-21  1  3   test  foo
3  1 2016-12-21  1  3  train  foo

In [18]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [21]:
df2.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [23]:
df2.values

array([[1.0, Timestamp('2016-12-21 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2016-12-21 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2016-12-21 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2016-12-21 00:00:00'), 1.0, 3, 'train', 'foo']], dtype=object)

In [25]:
df2.describe()

       A  C  D
count  4  4  4
mean   1  1  3
std    0  0  0
min    1  1  3
25%    1  1  3
50%    1  1  3
75%    1  1  3
max    1  1  3

In [28]:
df2.T.T

   A                    B  C  D      E    F
0  1  2016-12-21 00:00:00  1  3   test  foo
1  1  2016-12-21 00:00:00  1  3  train  foo
2  1  2016-12-21 00:00:00  1  3   test  foo
3  1  2016-12-21 00:00:00  1  3  train  foo

In [30]:
df.sort_values(by='B')

                   A         B         C         D
2016-01-05  0.298535 -0.532091  0.766118  0.033809
2016-01-01  0.357269 -0.049457 -1.283958  1.226443
2016-01-03  0.557898  0.573969 -0.299545 -0.881255
2016-01-04 -0.351362  0.814559  0.559755 -0.906109
2016-01-02 -1.745362  2.344277  0.800201  0.002229

In [32]:
## Selection by Label in pandas

# select a single column
df['A']

2016-01-01    0.357269
2016-01-02   -1.745362
2016-01-03    0.557898
2016-01-04   -0.351362
2016-01-05    0.298535
Freq: D, Name: A, dtype: float64

In [42]:
# select multiple columns
df.loc['20160101':'20160102',['A', 'B']]

                   A         B
2016-01-01  0.357269 -0.049457
2016-01-02 -1.745362  2.344277

In [44]:
# select a row
df.loc['20160104']

A   -0.351362
B    0.814559
C    0.559755
D   -0.906109
Name: 2016-01-04 00:00:00, dtype: float64

In [46]:
df.loc['20160104', ['A', 'B']]

A   -0.351362
B    0.814559
Name: 2016-01-04 00:00:00, dtype: float64

In [51]:
df2.loc[0, 'A']

1.0

In [53]:
## select by position
### select a single row
df.iloc[1]

A   -1.745362
B    2.344277
C    0.800201
D    0.002229
Name: 2016-01-02 00:00:00, dtype: float64

In [57]:
### select a single column
df.iloc[:,[1]]

                   B
2016-01-01 -0.049457
2016-01-02  2.344277
2016-01-03  0.573969
2016-01-04  0.814559
2016-01-05 -0.532091

In [59]:
### select a single column with row index 0, 1, 4
df.iloc[[0, 1, 3],[1]]

                   B
2016-01-01 -0.049457
2016-01-02  2.344277
2016-01-04  0.814559

In [61]:
### For getting a value explicitly
df.iloc[0,0]

0.35726852586961005

In [63]:
# Boolean Indexing
df[df.A > 0]

                   A         B         C         D
2016-01-01  0.357269 -0.049457 -1.283958  1.226443
2016-01-03  0.557898  0.573969 -0.299545 -0.881255
2016-01-05  0.298535 -0.532091  0.766118  0.033809

In [65]:
df[df > 0]

                   A         B         C         D
2016-01-01  0.357269       NaN       NaN  1.226443
2016-01-02       NaN  2.344277  0.800201  0.002229
2016-01-03  0.557898  0.573969       NaN       NaN
2016-01-04       NaN  0.814559  0.559755       NaN
2016-01-05  0.298535       NaN  0.766118  0.033809

In [69]:
df3 = df.copy()

In [75]:
df3['D'] = ['one', 'one', 'two', 'three', 'four']
df3

                   A         B         C      D
2016-01-01  0.357269 -0.049457 -1.283958    one
2016-01-02 -1.745362  2.344277  0.800201    one
2016-01-03  0.557898  0.573969 -0.299545    two
2016-01-04 -0.351362  0.814559  0.559755  three
2016-01-05  0.298535 -0.532091  0.766118   four

In [77]:
df3[df3['D'].isin(['two', 'four'])]

                   A         B         C     D
2016-01-03  0.557898  0.573969 -0.299545   two
2016-01-05  0.298535 -0.532091  0.766118  four

In [81]:
# setting
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20160101', periods=6))
s1

2016-01-01    1
2016-01-02    2
2016-01-03    3
2016-01-04    4
2016-01-05    5
2016-01-06    6
Freq: D, dtype: int64